adding the docs
